**SQL Coding Challenge - Getting Started**
---
In this challenge, you'll explore some tables in a relational database, and write SQL queries to answer questions.

*Note* - we're still using Colab for challenge description/turn-in, but we're not running the SQL here as it's not a natural application of the tool.

To access the data and interface for this challenge: http://sqlfiddle.com/#!9/dd3fe5/1

Start by looking at how the tables were built (on the left). These are all themselves SQL statements, oriented towards the specification of a schema (types for data in the database) and insertion of appropriate data.

The given queries (on the right) are the simplest sorts of SQL queries - `select *`

A `select * from table` query retrieves data from a table, where `*` means retrieve all available columns. You can limit the retrieved columns by specifying them (separated by commas) instead of `*`, e.g. `select col1, col2 from table`.

There are many other queries possible, as well as more ways to refine queries and `join` data from across multiple tables. For details, please see: https://github.com/LambdaSchool/Relational-Databases

Try crafting a few of your own queries, using the reference above, and then work on answering the following questions (save the text of your successful SQL queries as text cells in this notebook below their respective questions - see Q0 as an example, and answer starting from Q1). All questions refer specifically to the given data, and should be answered both with the working query and the result of the query.

**Q0 (Example)**

Return all rows and all columns of the Authors table.

**Q0 Answer**

`select * from Authors;`

```
Id	Name	Country
1	J.D. Salinger	USA
2	F. Scott. Fitzgerald	USA
3	Jane Austen	UK
4	Scott Hanselman	USA
5	Jason N. Gaylord	USA
6	Pranav Rastogi	India
7	Todd Miranda	USA
8	Christian Wenz	USA
```

(You can make the query result pretty by pasting it between triple-` symbols before and after.)

**Q1**

Return all the book titles from the Books table.

```select Title from Books;```

``` Title
The Catcher in the Rye
Nine Stories
Franny and Zooey
The Great Gatsby
Tender is the Night
Pride and Prejudice
Professional ASP.NET 4.5 in C# and VB ```

**Q2**

Return all the unique countries that have authors in them (unique -> there shouldn't be any duplicates in your results).


``` select distinct country from Authors; ```

```country
USA
UK
India```

**Q3**

How many books did J.D. Salinger write?

```select count(BookId) from BooksAuthors where AuthorId in (select Id from Authors where Name = 'J.D. Salinger');```



```count(BookId)
3```

**Q4**

Who (i.e. what was the author name) wrote the book titled Pride and Prejudice?

``` select Id,Name from Authors where Id in(select AuthorId from BooksAuthors where BookId in (select Id from Books where Title = 'Pride and Prejudice')); ```

```Name 
	Jane Austen ```

**Q5**

How many books have more than one author?

```select count(distinct(BookId)) from BooksAuthors group by BookId having count(AuthorId) > 1;```

```count(distinct(BookId))
1```

**Q6**

How many books were written by authors from the USA?

``` select count(distinct(BookId)) from BooksAuthors where AuthorId in (select Id from Authors where country = 'USA') ```

```count(distinct(BookId))
6```

**Q7**

This is not a question to be answered with a query - instead, in your own words, describe what the `BooksAuthors` table is and what purpose it serves. \\

BooksAuthors table is the table showing the details of books and the associated authors. It establishes relation between books and authors.